let quotes = [
    {
        quote: "Чем умнее человек, тем легче он признает себя дураком.", source: "Альберт Эйнштейн" 
        
    },
{        
        quote: "Никогда не ошибается тот, кто ничего не делает.", source: "Теодор Рузвельт" 
    
    },
{        
        quote: "Менее всего просты люди, желающие казаться простыми.", source: "Лев Николаевич Толстой" 
    
    },
{        
        quote: "Мы находимся здесь, чтобы внести свой вклад в этот мир. Иначе зачем мы здесь?", source: "Стив Джобс" 
    
    },
{       
        quote: "Мода проходит, стиль остаётся.", source: "Коко Шанель" 
    
    },
{        
        quote:"Если человек не нашёл, за что может умереть, он не способен жить.", source: "Мартин Лютер Кинг" 
    
    },
 {       
        quote: "Музыка заводит сердца так, что пляшет и поёт тело. А есть музыка, с которой хочется поделиться всем, что наболело.", source: "Джон Леннон" 
    
    },
 {       
        quote: "Если кто-то причинил тебе зло, не мсти. Сядь на берегу реки, и вскоре ты увидишь, как мимо тебя проплывает труп твоего врага.", source: "Лао-цзы" 
    
    },
 {       
        quote: "Лучше быть хорошим человеком, 'ругающимся матом', чем тихой, воспитанной тварью.", source: "Фаина Раневская" 
    
    },
  {      
        quote: ",Если тебе тяжело, значит ты поднимаешься в гору. Если тебе легко, значит ты летишь в пропасть.", source: "Генри Форд "
    
    },
 {       
        quote: "Мой способ шутить – это говорить правду. На свете нет ничего смешнее.",source: "Бернард Шоу" 
    
    },
 {       
        quote: "Чем больше любви, мудрости, красоты, доброты вы откроете в самом себе, тем больше вы заметите их в окружающем мире.", source: "Мать Тереза" 
    
    },
 {       
        quote: ",Единственный человек, с которым вы должны сравнивать себя, – это вы в прошлом. И единственный человек, лучше которого вы должны быть, – это вы сейчас.", source: "Зигмунд Фрейд" 
    
    },
 {       
        quote: "Невозможность писать для меня равносильна погребению заживо...", source: "Михаил Булгаков" 
    
    },
 {       
        quote: "История – самый лучший учитель, у которого самые плохие ученики.", source: "Индира Ганди"
    },
 {       
        quote: "Дай человеку власть, и ты узнаешь, кто он.",source: " Наполеон Бонапарт" 
    
    },
  {      
        quote: ",Ядерную войну невозможно выиграть.", source: "Андрей Сахаров" 
    
    },
 {       
        quote: "Поражение? Я не понимаю значения этого слова.", source: "Маргарет Тэтчер"
    
    }, 
 {       
        quote: "Некоторые люди проводят жизнь в поисках любви вне их самих... Пока любовь в моём сердце, она повсюду.", source: "Майкл Джексон" 
    
    },
 {       
        quote: "Человечество обладает одним поистине мощным оружием, и это смех.", source: "Марк Твен" 
    
    },
 {       
        quote: "Тренируйся с теми, кто сильнее. Не сдавайся там, где сдаются другие. И победишь там, где победить нельзя.", source: "Брюс Ли" 
    
    },
 {       
        quote: "Комедия – это очень серьёзное дело!",source: " Юрий Никулин" 
    
    },
 {       
        quote: "Будьте менее любопытны о людях, но более любопытны об идеях.", source: "Мария Кюри" 
    
    },
 {       
        quote: "Когда я собираюсь писать новый сценарий, самое трудное для меня – это пойти в канцтовары и купить блокнот.", source: "Квентин Тарантино" 
    
    },
{        
        quote: "Ненавижу всяческую мертвечину! Обожаю всяческую жизнь!", source: "Владимир Маяковский" 
    
    },
{        
        quote: ",Мышление – верх блаженства и радость жизни, доблестнейшее занятие человека.", source: "Аристотель" 
    
    },
 {       
        quote: "У тебя есть враги? Хорошо. Значит, в своей жизни ты что-то когда-то отстаивал.", source: "Уинстон Черчилль" 
    
    },
 {       
        quote: "Когда-нибудь не страшно умереть – страшно умереть вот сейчас.", source: "Александр Солженицын" 
    
    },
 {       
        quote: "Я серьёзно отношусь к своей работе, а это возможно только при несерьёзном отношении к собственной персоне.", source: "Алан Рикман" 
    
    },
 {       
        quote: "Характер – это и есть судьба.", source: "Майя Плисецкая" 
    
    },
 {       
        quote: "Внимай лишь одному учителю – Природе", source: "Рембрандт" 
    
    },
 {       
        quote: "Успех – паршивый учитель. Он заставляет умных людей думать, что они не могут проиграть.", source: "Билл Гейтс" 
    
    },
{        
        quote: "Чемпионами становятся не в тренажёрных залах. Чемпиона рождает то, что у человека внутри: желания, мечты, цели.", source: "Мухаммед Али "
    
    },
{        
        quote: "Люди – слишком сложные существа, чтобы понять их полностью.", source: "Том Хэнкс" 
    
    },
{        
        quote: "Перспектива рано умереть заставила меня понять, что жизнь стоит того, чтобы её прожить.", source: "Стивен Хокинг "
    
    },
{        
        quote: "Не так уж сложно изменить общество – сложно изменить себя.", source: "Нельсон Мандела" 
    
    },
{        
        quote: "Необходимо, чтобы художник, кроме глаза, воспитывал и свою душу.", source: "Василий Кандинский "
    
    },
{        
        quote: "Я дышу, и значит – я люблю! Я люблю, и значит – я живу!", source: "Владимир Высоцкий" 
    
    },
{        
        quote: "Фантазия мужчины – лучшее оружие женщины.", source: "Софи Лорен" 
    
    },
 {       
        quote: "То, что мы знаем, это капля, а то, что мы не знаем, это океан.", source: "Исаак Ньютон" 
    
    },
 {       
        quote: "Ни высокий интеллект, ни воображение, ни то и другое вместе не творят гения. Любовь, любовь и любовь – вот в чём сущность гения.", source: "Вольфганг Амадей Моцарт" 
    
    },
{        
        quote: "Оправдайте, не карайте, но назовите зло злом.", source: "Фёдор Достоевский "
    
    },
{        
        quote: "Не оборачивается тот, кто устремлён к звёздам.", source: "Леонардо да Винчи "
    
    },
{        
        quote: "Ненавижу советы – все, кроме своих.", source: "Джек Николсон" 
    
    },
{        
        quote: "Красота женщины множится вместе с её годами.", source: "Одри Хепберн" 
    
    },
{        
        quote: "Шире открой глаза, живи так жадно, как будто через десять секунд умрёшь. Старайся увидеть мир. Он прекраснее любой мечты, созданной на фабрике и оплаченной деньгами. Не проси гарантий, не ищи покоя – такого зверя нет на свете.", source: "Рэй Брэдбери" 
    
    },
{        
        quote: "Я пью, чтобы окружающие меня люди становились интереснее.", source: "Эрнест Хемингуэй" 
    
    },
{        
        quote: "Видите ли, художника отличает то, что в его жизни бывают минуты, когда он ощущает себя больше чем человеком.", source: "Ле Корбюзье" 
    
    },
{
        quote: "Любовь к собственному благу производит в нас любовь к отечеству, а личное самолюбие – гордость народную, которая служит опорою патриотизма.", source: "Николай Карамзин" 
    
    },
{
        quote: "Любите искусство в себе, а не себя в искусстве.", source: "Константин Станиславский" 
    
    },
    
];

function getRandomQuote () {
	var randomNumber = Math.floor(Math.random() * (quotes.length));
	var randomQuote = quotes[randomNumber];
	return randomQuote;
}	

//Function to select random rgb color value
function getRandomColor () {
	var red = Math.floor(Math.random() * 256 );
	var green = Math.floor(Math.random() * 256 );
	var blue = Math.floor(Math.random() * 256 );
	 var randomColor = 'rgb(' + red + ',' + green + ',' + blue + ')';
	return randomColor;
}

//Function to call the getRandomQuote function and stores the returned quote object in a variable
//Constructs a string containing the different properties of the quote object 
function printQuote () {
		var quotes = getRandomQuote ();
		var quoteContainer = document.getElementById("quote-box");
		var quoteString = `<p class="quote">${quotes.quote}</p><p class="source">${quotes.source}`;
				if (quotes.citation) {quoteString += `<span class="citation">${quotes.citation}</span>`}
				if (quotes.year) {quoteString += `<span class="year">${quotes.year}</span></p>`}
				else {quoteString += '</p>'};
					quoteContainer.innerHTML = quoteString;

					//assigns random color value to document background color 
					document.body.style.backgroundColor = getRandomColor ();
}

//Quote automatically refreshes every 15 seconds
window.setInterval(function(){
printQuote ();
}, 15000);

//Event listener on LoadQuote button to generate new quote		
document.getElementById("loadQuote").addEventListener("click", printQuote, false);




